[
    {
      "name": "Elf 1",
      "effect": "Swift: Increase base movement speed by 2 metres"
    },
    {
      "name": "Elf 2",
      "effect": "Surefooted: Ignore any movement speed penalties suffered as a result of rough terrain. Additionally, you gain +4 to checks made to avoid tripping over terrain."
    },
    {
      "name": "Dwarf 1",
      "effect": "Dwarven Toughness: Once per day, when you are reduced to 0 health you are not immediately put into a dying state. Instead you are reduced to 1 health unless the hit would immediately kill you."
    },
    {
      "name": "Dwarf 2",
      "effect": "Hardy: Gain damage resistance to poison damage. Additionally: You gain +2 to saves against gaining the poison condition."
    },
    {
      "name": "Goblin 1",
      "effect": "Night Vision: Gain dark sight of 30 metres."
    },
    {
      "name": "Goblin 2",
      "effect": "Mountain Dweller:  Gain a climb speed equal to your movement speed"
    },
    {
      "name": "Human 1",
      "effect": "Jack of all trades: Alongside your chosen background you may select an additional upbringing feature."
    },
    {
      "name": "Human 2",
      "effect": "Adaptable: Choose one skill of: lore, tradition, naturalism, animal handling or athletics to be increased to 1D6 regardless of the level of its governing attribute. Additionally you may choose from the following mundane skills to also increase to 1D6: riding, farming, architecture, carpentry and bee keeping."
    },
    {
      "name": "Halfling 1",
      "effect": "Everybody Loves a Halfling!: Reroll 1s when making Deception, Persuasion and Performance checks. Additionally, each of these skills start at 1D4."
    },
    {
      "name": "Halfling 2",
      "effect": "Nimble Folk: A Halfling may move through a hex occupied by any creature of a larger size category than themselves, provided they do not end their movement in one of those hexes. Doing so will allow the creature to make an attack of opportunity."
    },
    {
      "name": "Orc 1",
      "effect": "Brutish: Before rolling for damage with a weapon you may opt for your damage to explode the two highest values of your damage dice. If you choose to do this any additional damage generated by exploding dice is also dealt to you."
    },
    {
      "name": "Orc 2",
      "effect": "Dauntless: You may gain +2 to saves against the frightened and charmed conditions. Additionally, while frightened you may still move towards the creature you are frightened of."
    },
    {
      "name": "Ratfolk 1",
      "effect": "Mob Mentality: When Ratfolk are adjacent to an ally they may re-roll 1s when making melee attacks."
    },
    {
      "name": "Ratfolk 2",
      "effect": "Prehensile Tail: Ratfolk can use their tail to hold items, though they cannot use these held items in any complex way such as swinging a sword or blocking with a shield.   Sensitive Nose: Gain blind sight of 10 metres."
    },
    {
      "name": "Lizardfolk 1",
      "effect": "Reptile features"
    },
    {
      "name": "Lizardfolk 2",
      "effect": "Reptile features"
    }
  ]
  